app/controllers/guests_controller.rb

  def show
    @guest = Guest.find(params[:id])
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @guest = Guest.find(params[:id])
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit_info
    @guest = Guest.find_by_id(session[:guest_id])
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" IS NULL LIMIT 1

  def create
    @guest = Guest.new(params[:guest])
    @guest.password = params[:password]
    respond_to do |format|
      if @guest.save
---
INSERT INTO "guests" ("created_at", "email", "firstname", "lastname", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 16 Apr 2013 21:44:24 UTC +00:00], ["email", "keduong@gmail.com"], ["firstname", "Kenny"], ["lastname", "Duong"], ["updated_at", Tue, 16 Apr 2013 21:44:24 UTC +00:00]]

  def update
    @guest = Guest.find(params[:id])
    @guest.password = params[:password]
    respond_to do |format|
      if @guest.save and @guest.update_attributes(params[:guest])
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "guests" SET "password_digest" = '$2a$10$NsbfpilRWF1OyXz5bKfT1OtY5wFfgiAmP0mhaEqsxkFzT017UtOsC', "addrzip" = '', "updated_at" = '2013-05-14 23:43:46.344355' WHERE "guests"."id" = 5

  def update_info
    @guest = Guest.find_by_id(session[:guest_id])
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" = 1 LIMIT 1

  def destroy
    @guest = Guest.find(params[:id])
    @guest.destroy
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "guests" WHERE "guests"."id" = $1  [["id", 2]]