app/controllers/home_controller.rb

SELECT "guests".* FROM "guests" WHERE "guests"."id" IS NULL LIMIT 1
---
  def index
    @guest = Guest.find_by_id(session[:guest_id])