app/controllers/sessions_controller.rb

  def create
    guest_by_email = Guest.find_by_email(params[:login])
    guest_by_sitekey = Guest.find_by_sitekey(params[:login])
---
SELECT "guests".* FROM "guests" WHERE "guests"."email" = 'keduong' LIMIT 1
SELECT "guests".* FROM "guests" WHERE "guests"."sitekey" = 'keduong' LIMIT 1

  def create_admin
    logger.debug("Login is ...#{params[:login]}")
    guest = Guest.find_by_email(params[:login])
---
SELECT "guests".* FROM "guests" WHERE "guests"."email" = '{:value=>nil}' LIMIT 1